sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/getAvailableModules.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.getAvailableModules">
   <soapenv:Header/>
    <soapenv:Body>
     <sug:sugarCRMApiUrl>https://ypbvhe6054.trial.sugarcrm.com/soap.php</sug:sugarCRMApiUrl>    	
    	   <sug:session>cro7jca0b80vklrha2u4qdlnk7</sug:session>
    	   <sug:filter>all</sug:filter>
   </soapenv:Body>
</soapenv:Envelope>